### Importing Libraries

In [5]:
import numpy as np
from sklearn.cluster import MeanShift, KMeans
from sklearn import preprocessing
import pandas as pd
import matplotlib.pyplot as plt


### Importing titanic dataset and setting it as data frame

In [7]:
df = pd.read_excel('titanic.xls')

### making a copy of data frame, So that we can use to test it

In [9]:
original_df = pd.DataFrame.copy(df)

### Let's see the dataset

In [11]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

### Lets drop name and body from the data frame

In [12]:
df.drop(['body','name'], 1, inplace=True)

### preprocessing the data

In [13]:
df.fillna(0,inplace=True)

### Creating function to handle non numeric data , as non-numberic data won't be able plot or process in algortihm. It would not give us any good insights

In [15]:
def handle_non_numerical_data(df):
    
    columns = df.columns.values

    for column in columns:
        text_digit_vals = {}
        def convert_to_int(val):
            return text_digit_vals[val]

        if df[column].dtype != np.int64 and df[column].dtype != np.float64:
            
            column_contents = df[column].values.tolist()
            # set is use to get unique data
            unique_elements = set(column_contents)
            x = 0
            for unique in unique_elements:
                if unique not in text_digit_vals:
                    text_digit_vals[unique] = x
                    x+=1
            df[column] = list(map(convert_to_int,df[column]))

    return df

In [16]:
df = handle_non_numerical_data(df)

In [17]:
X = np.array(df.drop(['survived'], 1).astype(float))
y = np.array(df['survived'])

### Preprocessing is use to scale the sparse data

In [19]:
X = preprocessing.scale(X)

### Declaring Mean Shift object and create a fitment

In [20]:
clf = MeanShift()
clf.fit(X)

MeanShift(bandwidth=None, bin_seeding=False, cluster_all=True, min_bin_freq=1,
     n_jobs=None, seeds=None)

### Let looks what all we got from Mean Shift

In [21]:
labels = clf.labels_
cluster_centers = clf.cluster_centers_

### Now we will use copy of dataframe which we had created before, and would add cluster group to it

In [23]:
original_df['cluster_group']=np.nan

In [24]:
for i in range(len(X)):
    original_df['cluster_group'].iloc[i] = labels[i]

/home/samihan/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:205: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

### lets check survival rate of each group of cluster we find out

In [27]:
n_clusters_ = len(np.unique(labels))
survival_rates = {}
for i in range(n_clusters_):
    temp_df = original_df[ (original_df['cluster_group']==float(i)) ]
    #print(temp_df.head())

    survival_cluster = temp_df[  (temp_df['survived'] == 1) ]

    survival_rate = len(survival_cluster) / len(temp_df)
    #print(i,survival_rate)
    survival_rates[i] = survival_rate
    
print(survival_rates)

{0: 0.3762685402029664, 1: 0.8947368421052632, 2: 0.1111111111111111}

### By above information we can say that people in group 0 has 37% of survival rate that in group 1 is 89% and group 2 is 11%

### lets see how data is been classify in this group

first let's check group having highest percent

In [34]:
print(original_df[ (original_df['cluster_group']==1) ])

     pclass  survived                                               name  \
11        1         1  Astor, Mrs. John Jacob (Madeleine Talmadge Force)
17        1         1    Baxter, Mrs. James (Helene DeLaudeniere Chaput)
35        1         1                           Bowen, Miss. Grace Scott
49        1         1                 Cardeza, Mr. Thomas Drake Martinez
50        1         1  Cardeza, Mrs. James Warburton Martinez (Charlo...
66        1         1                        Chaudanson, Miss. Victorine
103       1         1                      Endres, Miss. Caroline Louise
111       1         1                     Fortune, Miss. Alice Elizabeth
112       1         1                         Fortune, Miss. Ethel Flora
113       1         1                         Fortune, Miss. Mabel Helen
115       1         0                                  Fortune, Mr. Mark
116       1         1                Fortune, Mrs. Mark (Mary McDougald)
183       1         1                             Lesurer, Mr. Gustave J
249       1         1                        Ryerson, Master. John Borie
250       1         1                         Ryerson, Miss. Emily Borie
251       1         1              Ryerson, Miss. Susan Parker "Suzette"
252       1         0                         Ryerson, Mr. Arthur Larned
253       1         1    Ryerson, Mrs. Arthur Larned (Emily Maria Borie)
302       1         1                                   Ward, Miss. Anna

        sex   age  sibsp  parch    ticket      fare            cabin embarked  \
11   female  18.0      1      0  PC 17757  227.5250          C62 C64        C
17   female  50.0      0      1  PC 17558  247.5208          B58 B60        C
35   female  45.0      0      0  PC 17608  262.3750              NaN        C
49     male  36.0      0      1  PC 17755  512.3292      B51 B53 B55        C
50   female  58.0      0      1  PC 17755  512.3292      B51 B53 B55        C
66   female  36.0      0      0  PC 17608  262.3750              B61        C
103  female  38.0      0      0  PC 17757  227.5250              C45        C
111  female  24.0      3      2     19950  263.0000      C23 C25 C27        S
112  female  28.0      3      2     19950  263.0000      C23 C25 C27        S
113  female  23.0      3      2     19950  263.0000      C23 C25 C27        S
115    male  64.0      1      4     19950  263.0000      C23 C25 C27        S
116  female  60.0      1      4     19950  263.0000      C23 C25 C27        S
183    male  35.0      0      0  PC 17755  512.3292             B101        C
249    male  13.0      2      2  PC 17608  262.3750  B57 B59 B63 B66        C
250  female  18.0      2      2  PC 17608  262.3750  B57 B59 B63 B66        C
251  female  21.0      2      2  PC 17608  262.3750  B57 B59 B63 B66        C
252    male  61.0      1      3  PC 17608  262.3750  B57 B59 B63 B66        C
253  female  48.0      1      3  PC 17608  262.3750  B57 B59 B63 B66        C
302  female  35.0      0      0  PC 17755  512.3292              NaN        C

    boat  body                                       home.dest  cluster_group
11     4   NaN                                    New York, NY            1.0
17     6   NaN                                    Montreal, PQ            1.0
35     4   NaN                                 Cooperstown, NY            1.0
49     3   NaN  Austria-Hungary / Germantown, Philadelphia, PA            1.0
50     3   NaN                    Germantown, Philadelphia, PA            1.0
66     4   NaN                                             NaN            1.0
103    4   NaN                                    New York, NY            1.0
111   10   NaN                                    Winnipeg, MB            1.0
112   10   NaN                                    Winnipeg, MB            1.0
113   10   NaN                                    Winnipeg, MB            1.0
115  NaN   NaN                                    Winnipeg, MB            1.0
116   10   NaN                                    Winnipeg, MB            1.0
183    3   NaN                                             NaN            1.0
249    4   NaN                 Haverford, PA / Cooperstown, NY            1.0
250    4   NaN                 Haverford, PA / Cooperstown, NY            1.0
251    4   NaN                 Haverford, PA / Cooperstown, NY            1.0
252  NaN   NaN                 Haverford, PA / Cooperstown, NY            1.0
253    4   NaN                 Haverford, PA / Cooperstown, NY            1.0
302    3   NaN                                             NaN            1.0

In [37]:
print(original_df[ (original_df['cluster_group']==0) ])

      pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
1          1         1                   Allison, Master. Hudson Trevor
2          1         0                     Allison, Miss. Helen Loraine
3          1         0             Allison, Mr. Hudson Joshua Creighton
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine
1306       3         0                        Zakarian, Mr. Mapriededer
1307       3         0                              Zakarian, Mr. Ortin
1308       3         0                               Zimmerman, Mr. Leo

         sex      age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.0000      0      0   24160  211.3375       B5        S    2
1       male   0.9167      1      2  113781  151.5500  C22 C26        S   11
2     female   2.0000      1      2  113781  151.5500  C22 C26        S  NaN
3       male  30.0000      1      2  113781  151.5500  C22 C26        S  NaN
4     female  25.0000      1      2  113781  151.5500  C22 C26        S  NaN
...      ...      ...    ...    ...     ...       ...      ...      ...  ...
1304  female  14.5000      1      0    2665   14.4542      NaN        C  NaN
1305  female      NaN      1      0    2665   14.4542      NaN        C  NaN
1306    male  26.5000      0      0    2656    7.2250      NaN        C  NaN
1307    male  27.0000      0      0    2670    7.2250      NaN        C  NaN
1308    male  29.0000      0      0  315082    7.8750      NaN        S  NaN

       body                        home.dest  cluster_group
0       NaN                     St Louis, MO            0.0
1       NaN  Montreal, PQ / Chesterville, ON            0.0
2       NaN  Montreal, PQ / Chesterville, ON            0.0
3     135.0  Montreal, PQ / Chesterville, ON            0.0
4       NaN  Montreal, PQ / Chesterville, ON            0.0
...     ...                              ...            ...
1304  328.0                              NaN            0.0
1305    NaN                              NaN            0.0
1306  304.0                              NaN            0.0
1307    NaN                              NaN            0.0
1308    NaN                              NaN            0.0

[1281 rows x 15 columns]

In [38]:
print(original_df[ (original_df['cluster_group']==2) ])

      pclass  survived                                               name  \
629        3         0                        Andersson, Mr. Anders Johan
632        3         0  Andersson, Mrs. Anders Johan (Alfrida Konstant...
646        3         1  Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...
831        3         0                     Goodwin, Mr. Charles Frederick
832        3         0            Goodwin, Mrs. Frederick (Augusta Tyler)
1106       3         0             Panula, Mrs. Juha (Maria Emilia Ojala)
1146       3         0               Rice, Mrs. William (Margaret Norton)
1179       3         0                              Sage, Mr. John George
1180       3         0                     Sage, Mrs. John (Annie Bullen)

         sex   age  sibsp  parch    ticket     fare cabin embarked boat  \
629     male  39.0      1      5    347082  31.2750   NaN        S  NaN
632   female  39.0      1      5    347082  31.2750   NaN        S  NaN
646   female  38.0      1      5    347077  31.3875   NaN        S   15
831     male  40.0      1      6   CA 2144  46.9000   NaN        S  NaN
832   female  43.0      1      6   CA 2144  46.9000   NaN        S  NaN
1106  female  41.0      0      5   3101295  39.6875   NaN        S  NaN
1146  female  39.0      0      5    382652  29.1250   NaN        Q  NaN
1179    male   NaN      1      9  CA. 2343  69.5500   NaN        S  NaN
1180  female   NaN      1      9  CA. 2343  69.5500   NaN        S  NaN

       body                             home.dest  cluster_group
629     NaN                   Sweden Winnipeg, MN            2.0
632     NaN                   Sweden Winnipeg, MN            2.0
646     NaN                 Sweden  Worcester, MA            2.0
831     NaN  Wiltshire, England Niagara Falls, NY            2.0
832     NaN  Wiltshire, England Niagara Falls, NY            2.0
1106    NaN                                   NaN            2.0
1146  327.0                                   NaN            2.0
1179    NaN                                   NaN            2.0
1180    NaN                                   NaN            2.0

### From above data we can find following insights

### From Cluster 1, We find that survival rate for Pclass = 1 has higher survival rate where as from cluster 2 we can say that Pclass = 3 lower survival rate